{
  "Interesting Developments LLC": {
    "name": "Interesting Developments LLC", 
    "role": "Frontend Engineer & Technical Project Manager",
    "location": "Remote",
    "url": "https://www.filicetti.dev",
    "client": "CONSULTANCY: PLUTUS DAO",
    "start": "04/2022",
    "end": "PRESENT",
    "summary": "Crafting seamless UI/UX solutions to drive your business forward. Sole proprietorship.",
    "overview": [
        "I was the 7th employee hired for my experience in leading teams and I brought the dApp from idea to product launch, allowing users to interact with our smart contracts, resulting in over $5M market cap and $1 peak token value.",
        "Deploying and reviewing easily scalable and maintainable code daily in a face-paced, iterative environment.",
        "Ensuring project deliverables meet the specified quality standards, and that quality control and assurance processes are in place to help lighten developer workload and manage tech debt.",
        "Managed weekly stand up meetings by applying agile methodologies (Scrum, Kanban) and utilizing Notion to define project scope, goals, and deliverables, as well as developing project schedules, budgets, and resource plans.",
        "Identifying, analyzing, and managing project risks, such as delays, cost overruns, and scope creep, to ensure the project remains on track and on budget.",
        "Communicating project status, progress, and issues to the 20,000+ members of the Plutus DAO online community."
      ]
    }, 
  "Trusted Creative": {
    "name": "Trusted Creative", 
    "role": "Software Engineer & Product Manager",
    "location": "Remote",
    "url": "https://trustedcreative.com/",
    "client": "",
    "start": "02/2020",
    "end": "04/2022",
    "summary": "Contracted as a frontend engineer for a 6 month product release with our most revenue generating client, retained for an additional 1.5 years and promoted to SDE/PrM, taking on additional tasks with our second largest client.",
    "overview": [
        "Key architectural decision maker managing databases and servers for 4000 active students and over 25,000 alumni.",
        "Lead research, presentation, adoption, implementation, testing, and maintenance of Selenium automation, AngularJS, Entity Framework, and Action Grid to meet business needs while enhancing performance and efficiency.",
        "Developed and integrated a new project request system for staff to understand project scope and avoid scope creep.",
        "Created and maintained custom Google Analytics dashboard for stakeholders, as well as generating and presenting custom analytics reporting and visualization upon request.",
        "Implemented agile development process, acting as product manager and leading a cross-functional team throughout the lifecycle of 7 different products for 2 of the company’s most strategic clients.",
        "Translating client needs into requirements into user stories, action items, tickets, and ultimately deliverables.",
        "Managed Zendesk ticketing to triage and prioritize customer needs, personally clearing 3-5 tickets per week and delegating as needed.",
        "Managed a team of 5 student interns through remote training, creation of robust documentation, and imbuing best practices at all levels.",
        "Google Analytics, Data Reporting/Visualization, and JavaScript SME."
      ]
    },
  "Keeper AI": {
    "name": "Keeper AI", 
    "role": "Lead Frontend Engineer",
    "location": "Bellevue, WA (Hybrid)",
    "url": "https://keeperai.com/",
    "client": "",
    "start": "06/2019",
    "end": "02/2020",
    "summary": "Lead Frontend Engineer and React.js subject matter expert. I worked on a cross-functional team with our founder, stakeholders, product manager, designers, UX researchers, and our sales team to make key product and UI/UX decisions throughout the product life cycle.",
    "overview": [
        "I was hired as Lead Frontend Engineer and React.js subject matter expert within 3 months of entering the field.",
        "I worked on a cross-functional team with our founder, stakeholders, product manager, designers, UX researchers, and our sales team to make key product and UX/UI decisions throughout the product life cycle.",
        "Agile development environment working with a product in flux to anticipate and meet client needs.",
        "Managed intern on-site training, daily stand-ups, 1:1 mentorship, code review, and unit testing/integration.",
        "Worked closely with backend team to ensure seamless integration with user interface",
        "Primary frontend SME (React.js, TypeScript/JavaScript, SCSS)."
      ]
    }
  }